common/.emacs.d/org-configuration.org
* Basic Settings
  Record the time that a todo was archived.

  #+BEGIN_SRC emacs-lisp
   (setq org-log-done 'time)
  #+END_SRC


  #+BEGIN_SRC emacs-lisp
    (setq org-directory "~/personal/")
  #+END_SRC

  #+BEGIN_SRC emacs-lisp
    (defun org-file-path (filename)
      "Return the absolute address of an org file, given its relative name."
      (concat (file-name-as-directory org-directory) filename))
  #+END_SRC


  This allows me to open org links in the same fram
  #+BEGIN_SRC emacs-lisp
    (setq org-link-frame-setup
    '((vm . vm-visit-folder-other-frame)
    (vm-imap . vm-visit-imap-folder-other-frame)
    (gnus . org-gnus-no-new-news)
    (file . find-file)
    (wl . wl-other-frame)))
  #+END_SRC

  better org folding indicator
  #+BEGIN_SRC emacs-lisp
    (setq org-ellipsis "⤵")
  #+END_SRC


* Capturing
  #+BEGIN_SRC emacs-lisp
    (setq org-default-notes-file (expand-file-name "~/personal/00-capture/capture.org"))
  #+END_SRC

* Refile
  primitive org-refile-target
  I hope to oneday programmatically generate

  #+BEGIN_SRC emacs-lisp
    (setq org-refile-targets (quote (
    ("~/personal/01-schedule/project-list.org" :maxlevel . 1)
    ("~/personal/01-schedule/next-actions.org" :maxlevel . 1))))
  #+END_SRC
* Archiving
  Store my org files in =~/org=

  #+BEGIN_SRC emacs-lisp
    (setq org-archive-location
    (concat (org-file-path "archive/archive.org") "::* From %s"))
  #+END_SRC

  Hitting =C-c C-x C-s= will mark a todo as done and move it to an appropriate
  place in the archive.

  #+BEGIN_SRC emacs-lisp
    (defun hrs/mark-done-and-archive ()
      "Mark the state of an org-mode item as DONE and archive it."
      (interactive)
      (org-todo 'done)
      (org-archive-subtree))

    (define-key org-mode-map (kbd "C-c C-x C-s") 'hrs/mark-done-and-archive)
  #+END_SRC
